'''Задание 1
Пользователь вводит с клавиатуры строку. Проверьте является ли введенная строка палиндромом. Палиндром — слово или текст,
которое читается одинаково слева направо и справа налево. Например, кок; А роза упала на лапу Азора; доход; А буду я у дуба.'''

# w = 'а роза упала на лапу азора'
# result_w = ''
# for symb in range(0, len(w)):
#     if symb != ' ':
#         result_w = result_w + w[symb]
# print(result_w)

# w = "t  r  y"
# w.replace(" ", "")
# print(w)

'''Задание 2
Пользователь вводит с клавиатуры некоторый текст, после чего пользователь вводит список зарезервированных слов. 
Необходимо найти в тексте все зарезервированные слова и изменить их регистр на верхний. Вывести на экран измененный текст. '''

s = 'So close, no matter how far. Couldn\'t be much more from the heart. Forever trusting who we are. And nothing else matters'
w1 = 'nothing'
w2 = 'else'
w3 = 'matters'


