'''Задание 1
Пользователь вводит с клавиатуры два числа (начало и конец диапазона). Требуется проанализировать все числа в этом диапазоне по следующему
правилу: если число кратно 7, его надо выводить на экран.'''
# a = 0
# b = 35
# if a == 0:
#     a = a + 1
# for i in range(a, b + 1):
#     if i % 7 == 0:
#         print(i, end=' ')
'''Задание 2
Пользователь вводит с клавиатуры два числа (начало и конец диапазона). Требуется проанализировать все числа в этом диапазоне. 
Нужно вывести на экран:
1. Все числа диапазона;
2. Все числа диапазона в убывающем порядке;
3. Все числа, кратные 7;
4. Количество чисел, кратных 5'''
# a = 0
# b = 45
# count_numb = 0
# for i in range(a, b + 1):
#     print(i, end=' ')
# print()
# for i in range(b, a - 1, -1):
#     print(i, end=' ')
# print()
# if a == 0:
#     a = a + 1
# for i in range(a, b + 1):
#     if i % 7 == 0:
#         print(i, end=' ')
# print()
# if a == 0:
#     a = a + 1
# for i in range(a, b + 1):
#     if i % 5 == 0:
#         count_numb = count_numb + 1
# print(count_numb)

'''Пользователь вводит с клавиатуры два числа (начало и конец диапазона). Требуется проанализировать все числа в этом диапазоне. 
Вывод на экран должен проходить по правилам, указанным ниже. Если число кратно 3 (делится на 3 без остатка) нужно вывести слово Fizz. 
Если число кратно 5 нужно вывести слово Buzz. Если число кратно 3 и 5 нужно вывести Fizz Buzz. Если число не кратно не 3 и 5 нужно вывести
само число.'''
# a = 0
# b = 15
# if a == 0:
#     a = a + 1
# for i in range(a, b + 1):
#     if i % 3 == 0 and i % 5 == 0:
#         print("Fizz Buzz")
#     elif i % 3 == 0:
#         print("Fizz")
#     elif i % 5 == 0:
#         print("Buzz")
#     else:
#         print(i)






