'''Задание 4
Пользователь вводит с клавиатуры строку и слово для поиска. Посчитайте сколько раз в строке встречается искомое слово.
Полученное число выведите на экран. * Без использования метода count'''
# s = 'Abrakadabra'
# symbol = 'ra'
# print(s.count(symbol))

'''Задание 5
Пользователь вводит с клавиатуры строку, слово для поиска, слово для замены. Произведите в строке замену одного слова на другое. 
Полученную строку отобразите на экране. * Без использования метода replace'''
# s = 'Abrakadabra'
# symbol = 'ra'
# new_symbol = 'RA'
# print(s.replace(symbol,new_symbol))
# print(s)

'''Задание 1
Есть некоторый текст. Реализуйте следующую функциональность:
■ Изменить текст таким образом, чтобы каждое предложение начиналось
с большой буквы;
■ Посчитайте сколько раз цифры встречаются в тексте;
■ Посчитайте сколько раз знаки препинания встречаются в тексте;
■ Посчитайте количество восклицательных знаков в тексте.'''

t = 'some interesting, text and else. what i am doing. how do you do? i am fine! thank you.'



